# GetPlantToolPlantName

## Description
Returns the name of the current plant that is stored in the plant tool.

```pascal
FUNCTION GetPlantToolPlantName : STRING;
```

```python

def vs.GetPlantToolPlantName():
    return STRING
```

## Version
Availability: from VectorWorks 2008
## Category
* Utility